# Ex - GroupBy

### Introduction:

GroupBy can be summarized as Split-Apply-Combine.

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

Check out this [Diagram](http://i.imgur.com/yjNkiwL.png)  
### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv).

### Step 3. Assign it to a variable called drinks.

In [2]:
address = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv'

drinks = pd.read_csv(address)

### Step 4. Which continent drinks more beer on average?

In [5]:
drinks['continent'].value_counts().sort_values(ascending=False)

AF    53
EU    45
AS    44
OC    16
SA    12
Name: continent, dtype: int64

### Step 5. For each continent print the statistics for wine consumption.

In [10]:
drinks.groupby('continent')['wine_servings'].describe()

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

In [20]:
drinks.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

### Step 6. Print the mean alcohol consumption per continent for every column

In [25]:
round(drinks.groupby('continent')[['wine_servings','beer_servings','spirit_servings','total_litres_of_pure_alcohol']].mean(),2)

,wine_servings,beer_servings,spirit_servings,total_litres_of_pure_alcohol
continent,,,,
AF,16.26,61.47,16.34,3.01
AS,9.07,37.05,60.84,2.17
EU,142.22,193.78,132.56,8.62
OC,35.62,89.69,58.44,3.38
SA,62.42,175.08,114.75,6.31

### Step 7. Print the median alcohol consumption per continent for every column

In [26]:
round(drinks.groupby('continent')[['wine_servings','beer_servings','spirit_servings','total_litres_of_pure_alcohol']].median(),2)

,wine_servings,beer_servings,spirit_servings,total_litres_of_pure_alcohol
continent,,,,
AF,2.0,32.0,3.0,2.30
AS,1.0,17.5,16.0,1.20
EU,128.0,219.0,122.0,10.00
OC,8.5,52.5,37.0,1.75
SA,12.0,162.5,108.5,6.85

### Step 8. Print the mean, min and max values for spirit consumption.
#### This time output a DataFrame

In [38]:
spirit_consumption = pd.DataFrame(columns=['mean', 'min' , 'max'])

spirit_consumption['mean'] = round(drinks.groupby('continent')['spirit_servings'].mean(),2)
spirit_consumption['min'] = drinks.groupby('continent')['spirit_servings'].min()
spirit_consumption['max'] = drinks.groupby('continent')['spirit_servings'].max()
spirit_consumption

             mean  min  max
continent
AF          16.34    0  152
AS          60.84    0  326
EU         132.56    0  373
OC          58.44    0  254
SA         114.75   25  302

In [40]:
round(drinks.groupby('continent').spirit_servings.agg(['mean', 'min', 'max']),2)

             mean  min  max
continent
AF          16.34    0  152
AS          60.84    0  326
EU         132.56    0  373
OC          58.44    0  254
SA         114.75   25  302